---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaTagBadViewType
source: html/eb8d5688-3a68-2782-69c1-f6467dce6a31.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaTagBadViewType Property

Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaTagBadViewType { get; }
```